samples/679.request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ZSI="http://www.zolera.com/schemas/ZSI/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Header></SOAP-ENV:Header><SOAP-ENV:Body xmlns:ns1="http://opcfoundation.org/webservices/XMLDA/1.0/"><ns1:Subscribe ReturnValuesOnReply="true" SubscriptionPingRate="3000"><ns1:Options ClientRequestHandle="CRH1" ReturnErrorText="true" ReturnItemName="true" ReturnItemPath="true"></ns1:Options><ns1:ItemList><ns1:Items ClientItemHandle="CIH3" ItemName="ItemName1"></ns1:Items><ns1:Items ClientItemHandle="CIH1" ItemName="ItemName2"></ns1:Items><ns1:Items ClientItemHandle="CIH2" ItemName="ItemName3"></ns1:Items></ns1:ItemList></ns1:Subscribe></SOAP-ENV:Body></SOAP-ENV:Envelope>